'''
视频中老师演示的代码
python开发基础27-列表的常用方法

'''

a = [1,1,2,[2.1,2.2,2.3],3,4]

#insert：在指定位置插入一个特点元素
a.insert(2,'hello')
print(a)

#pop:默认会删除列表中最后一个元素。但是也可以提供一个index参数，去删除指定位置的元素
a.pop()        #默认会删除列表中最后一个元素
print(a)

a.pop(2)      #通过指定元素坐标的方式来删除
print(a)

#remove：通过指定要删除的元素的值来删除
a.remove([2.1,2.2,2.3])
print(a)

a.remove(1)
print(a)    #remove只能删除找到的第一个元素

b = [1,2,3,1,2,3]
#delete：删除整个的变量空间
del b

#reverse:将列表中的元素反序
a.reverse()
print(a)


'''
Outputs:

[1, 1, 'hello', 2, [2.1, 2.2, 2.3], 3, 4]
[1, 1, 'hello', 2, [2.1, 2.2, 2.3], 3]
[1, 1, 2, [2.1, 2.2, 2.3], 3]
[1, 1, 2, 3]
[1, 2, 3]
[3, 2, 1]


'''
