'''

视频中老师演示的代码
python开发基础28-可变和不可变的数据类型

'''

print('#数值型（不可变）')
a = 1
print(id(a))
a = 2
print(id(a))

print('#字符串型（不可变)')
b = 'hello'
print(id(b))
b = 'world'
print(id(b))

print('#列表型（可变）')
c = [1,3,5]
print(id(c))
c.append(7)
print(id(c))

print('#元组型（*不可变）')
d = (2,4,6,c)
print(id(d))
c.append(9)     #元组型本身不可变；在改变元组内嵌套的列表的元素时，元组对应的内存地址不发生改变
print(id(d))

print('#集合型（可变）')
e = {1,2,3,'d'}
print(id(e))
e.add('4')
print(id(e))

print('#字典类型（可变）')
f = {'a':1, 'b':2}
print(id(f))
f['c'] = 3
print(id(f))

'''
Example Outputs:

#数值型（不可变）
4342114976
4342115008
#字符串型（不可变)
4345492656
4344873392
#列表型（可变）
4344866944
4344866944
#元组型（*不可变）
4345577696
4345577696
#集合型（可变）
4345942080
4345942080
#字典类型（可变）
4344824768
4344824768


'''















